quarkslab/sstic-tame-the-qemu/qemu/hw/misc/samd21_sercom.c
/*
 * SAMD21 SERCOM peripheral (USART/SPI)
 *
 * Copyright 2024 Damien Cauquil <dcauquil@quarkslab.com>
 *
 * This code is licensed under the GPL version 2 or later.  See
 * the COPYING file in the top-level directory.
 * 
 * 
 * The SERCOM interface implemented in the SAMD21 microcontroller supports
 * different protocols including USART and SPI. This is why this file is
 * present in the /hw/misc/ folder.
 * 
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "qapi/error.h"
#include "hw/arm/samd21.h"
#include "hw/misc/samd21_sercom.h"
#include "hw/irq.h"
#include "hw/qdev-properties-system.h"
#include "hw/qdev-properties.h"
#include "migration/vmstate.h"

/******************************************************************************
 * The following `samd21_update_irq` function sets the SERCOM interface IRQ
 * level based on:
 * 
 *  - the event flags set in this SERCOM INTFLAG register: DRE, TXC, RXC, RXS,
 *    CTSIC, RXBRK and ERROR
 *  - the interrupt events enabled by the software through the INTENSET register
 * 
 * The IRQ is raised if at least one event flag is set and the corresponding
 * interrupt event enabled. If an interrupt flag is set but not enabled then
 * no IRQ will be raised.
 * 
 *****************************************************************************/
static void samd21_update_irq(SAMD21SERCOMState *s)
{
    uint8_t intflag = s->reg8[R_USART_INTFLAG];
    uint8_t intenset = s->interrupts;
    bool irq = false;

    /* DRE */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_DRE_MASK) &&
            (intenset & R_USART_INTFLAG_DRE_MASK));

    /* TXC */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_TXC_MASK) &&
            (intenset & R_USART_INTFLAG_TXC_MASK));

    /* RXC */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_RXC_MASK) &&
            (intenset & R_USART_INTFLAG_RXC_MASK));

    /* RXS */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_RXS_MASK) &&
            (intenset & R_USART_INTFLAG_RXS_MASK));

    /* CTSIC */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_CTSIC_MASK) &&
            (intenset & R_USART_INTFLAG_CTSIC_MASK));

    /* RXBRK */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_RXBRK_MASK) &&
            (intenset & R_USART_INTFLAG_RXBRK_MASK));

    /* ERROR */
    irq |= (intflag &&
            (intflag & R_USART_INTFLAG_ERROR_MASK) &&
            (intenset & R_USART_INTFLAG_ERROR_MASK));

    /* Set IRQ level (IRQ is triggered if level > 0). */
    qemu_set_irq(s->irq, irq);
}

static void sercom_spi_transfer(SAMD21SERCOMState *s)
{
    /* Send and receive byte. */
    s->reg16[R_SERCOM_DATA] = ssi_transfer(s->ssi, s->reg16[R_SERCOM_DATA] & 0xFF);

    /* Set DRE, RXC and TXC flag in the INTFLAG register, to tell the software that
       more bytes can be sent after this function call. */
    s->reg8[R_SPI_INTFLAG] |= (1 << R_SPI_INTFLAG_DRE_SHIFT);
    s->reg8[R_SPI_INTFLAG] |= (1 << R_SPI_INTFLAG_TXC_SHIFT);
    s->reg8[R_SPI_INTFLAG] |= (1 << R_SPI_INTFLAG_RXC_SHIFT);
}

/******************************************************************************
 * The `sercom_read` callback is in charge of handling any read operation
 * performed on SERCOM MMIO registers. Based on the datasheet, we must emulate
 * some internal operations when the application code reads some specific
 * registers like the DATA register used for data reception.
 * 
 * When the DATA register is read, we need to retrieve the next read byte from
 * our reception queue, motify QEMU that one byte has been read from the
 * associated character device (if current mode is USART) in order to keep
 * the emulated serial device backend working as expected.
 * 
 * Once read, we also set the interrupt flag and trigger another IRQ if more
 * data is waiting to be read in our reception queue, allowing the software
 * to loop on the received data until the reception queue is empty.
 * 
 * When the STATUS register is read, we provide its 16-bit value as stored in
 * the corresponding register bank.
 * 
 * Other registers are mostly 32-bits and can be read through the default
 * register handler.
 *****************************************************************************/

static uint64_t sercom_read(void *opaque, hwaddr addr, unsigned int size)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(opaque);
    uint64_t db;

    /* Process registers differently when required. */
    switch (addr)
    {
        /**
         * SERCOM DATA register needs to be handled in a very specific way,
         * as it is fully emulated (we will not write to the register in our
         * register bank). When this register is read and the SERCOM interface
         * is in USART mode, we grab the next character received from the MCU
         * `serial0` character device and return it as the register content.
         * 
         * If more data is waiting into our reception queue, we notify the
         * software that more data is waiting by setting the RXC flag (receive
         * complete event) and generating a corresponding IRQ if we have to.
         * 
         */
        case A_SERCOM_DATA:
            {
                /* Are we in USART mode ? */
                if (s->current_mode == SERCOM_USART)
                {
                    /* Do we have at least one character to retrieve ? */
                    if (s->rx_fifo_len > 0)
                    {
                        /* Read character from FIFO. */
                        db = s->rx_fifo[s->rx_fifo_pos];
                        if (s->rx_enabled && s->rx_fifo_len) {
                            s->rx_fifo_pos = (s->rx_fifo_pos + 1) % UART_FIFO_LENGTH;
                            s->rx_fifo_len--;
                            if (s->rx_fifo_len) {

                                /* If we have more data, set RXC bit of INTFLAG register to 1. */
                                s->reg8[R_USART_INTFLAG] |= (1 << R_USART_INTFLAG_RXC_SHIFT);

                                /* Generate an IRQ if required (RXC bit set and RXC interrupt event enabled). */
                                samd21_update_irq(s);
                            }
                            else
                            {
                                /* No more data, set RXC to 0. */
                                s->reg8[R_USART_INTFLAG] &= ~(1 << R_USART_INTFLAG_RXC_SHIFT);
                            }

