quarkslab/sstic-tame-the-qemu/qemu/hw/misc/samd21_sercom.c
                            /* Tell QEMU we have read one byte from our character device. */
                            qemu_chr_fe_accept_input(&s->chr);
                        }

                        /* Return the received byte to the application software. */
                        return db;
                    }
                }
                else if (s->current_mode == SERCOM_SPI)
                {
                    /* In SPI mode, we simply read the last received byte store in SERCOM_DATA. */
                    return (s->reg16[R_SERCOM_DATA] & 0xFF);
                }

                /* Not in USART mode or empty FIFO. */
                return 0;
            }
            break;

        /* SERCOM status register read operation. */
        case A_SERCOM_STATUS:
            {
                /* Return the 16-bit value corresponding to the STATUS register. */
                return s->reg16[R_SERCOM_STATUS];
            }
            break;

        /**
         * Other registers are simply read from our registers bank, based on
         * 4-byte aligned read operations.
         */

        default:
            return s->reg[addr/4];
            break;
    }
}

/******************************************************************************
 * The `uart_transmit` function is in charge of sending a byte to QEMU
 * serial character device. This function is triggered by software when the
 * SERCOM USART interface is used to send a byte, and will read the byte
 * sent by the software and forward it to the corresponding QEMU character\
 * device backend to let QEMU process it (for instance, if the character
 * device backend is a serial console bound to stdio, this character will be
 * displayed directly in the console).
 *****************************************************************************/

static gboolean uart_transmit(void *do_not_use, GIOCondition cond, void *opaque)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(opaque);
    int r;

    /* First, read the 16-bit DATA register and keep only the low 8 bits. */
    uint8_t c = s->reg16[R_SERCOM_DATA];

    /* Set DRE and TXC flag in the INTFLAG register, to tell the software that
       more bytes can be sent after this function call. */
    s->reg8[R_USART_INTFLAG] &= (~(1 << R_USART_INTFLAG_DRE_SHIFT) | (1 << R_USART_INTFLAG_TXC_SHIFT));

    /* Reset watch tag. Watch tags are used for asynchronous character device
       backends that may take some time to forward a byte. */
    s->watch_tag = 0;

    /* Ask QEMU character device backend to write our character to it. */
    r = qemu_chr_fe_write(&s->chr, &c, 1);
    if (r <= 0) {
        /*
         * Write operation to character device failed, we set up a watch in
         * order for this function to be called again and send the same byte
         * later.
         */
        s->watch_tag = qemu_chr_fe_add_watch(&s->chr, G_IO_OUT | G_IO_HUP,
                                             uart_transmit, s);

        /* Could not create a watch tag, abort transmission. */
        if (!s->watch_tag) {
            goto buffer_drained;
        }

        /* Success. */
        return G_SOURCE_REMOVE;
    }

/*
 * Byte has been processed, we set the DRE flag to allow another byte to be
 * written (datasheet states that this flag has to be set to write a byte into
 * the DATA register) and the TXC flag to tell the software we successfully
 * sent one byte onto the physical serial interface.
 * 
 * We then set the DATA register to 0.
 */

buffer_drained:
    s->reg8[R_USART_INTFLAG] |= (1 << R_USART_INTFLAG_DRE_SHIFT);
    s->reg8[R_USART_INTFLAG] |= (1 << R_USART_INTFLAG_TXC_SHIFT);
    s->reg16[R_SERCOM_DATA] = 0;
    s->pending_tx_byte = false;
    return G_SOURCE_REMOVE;
}

/**
 * Cancel USART transmission, especially when the SERCOM peripheral is
 * reset.
 */
static void uart_cancel_transmit(SAMD21SERCOMState *s)
{
    /*
     * If we were expecting the character device backend to call our
     * `uart_transmit` later, then we need to remove the corresponding
     * watch.
     */
    if (s->watch_tag) {
        g_source_remove(s->watch_tag);
        s->watch_tag = 0;
    }
}

/******************************************************************************
 * The `sercom_write` callback process any SERCOM register write operation. We
 * need to process specifically certain registers to correctly emulate the
 * peripheral behavior.
 * 
 * SERCOM CTRLA and CTRLB registers are used to:
 *  - Configure the communication protocol to use: USART, SPI, I2C and I2S. Only
 *    USART and SPI will are supported.
 *  - Enable or disable the reception and transmission operations on an interface
 * 
 * The `INTENSET` and `INTENCLR` registers are used to enable or disable
 * specific interrupt events. These events will then be used by the
 * `samd21_update_irq` function to generate (or not) an IRQ.
 * 
 * When the DATA register is written, we set the provided value into memory
 * and call the `uart_transmit` function if the current mode is set to USART,
 * emulating a real USART character transmit onto the associated character
 * device backend.
 * 
 *****************************************************************************/

static void sercom_write(void *opaque, hwaddr addr,
                       uint64_t value, unsigned int size)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(opaque);
    uint8_t mode, enabled;

    switch (addr)
    {
        /**
         * Handle CTRLA register write operations. This register is mostly
         * used to configure the protocol used by the SERCOM interface or
         * to reset the peripheral.
         */
        case A_USART_CTRLA:
            {
                /* Do we need to reset this peripheral ? */
                if (value & R_USART_CTRLA_SWRST_MASK)
                {
                    /* Reset required. */
                    s->pending_tx_byte = false;

                    /* Cancel any ongoing byte transmission. */
                    uart_cancel_transmit(s);

                    /* Reset registers values. */
                    memset(s->reg, 0, sizeof(s->reg));

