quarkslab/sstic-tame-the-qemu/qemu/hw/misc/samd21_sercom.c
                    /* Flush FIFO, disable RX and TX and disable interface. */
                    s->rx_fifo_len = 0;
                    s->rx_fifo_pos = 0;
                    s->rx_enabled = false;
                    s->tx_enabled = false;
                    s->enabled = false;

                    /* No mode specified. */
                    s->current_mode = SERCOM_UNSUPPORTED;
                }
                else
                {
                    /*
                     * Configuration has been changed, take into account the
                     * requested mode and enable this interface if required.
                     */
                    mode = (value & R_USART_CTRLA_MODE_MASK) >> R_USART_CTRLA_MODE_SHIFT;
                    enabled = (value & R_USART_CTRLA_ENABLE_MASK) >> R_USART_CTRLA_ENABLE_SHIFT;

                    /* Is mode updated ? */
                    switch (mode)
                    {
                        /* USART */
                        case 0:
                        case 1:
                            {
                                /* Current mode is USART. */
                                s->current_mode = SERCOM_USART;

                                /*
                                 * When USART protocol is enabled, we set the
                                 * DRE bit of INTFLAG to 1 to tell the software
                                 * that we are ready to transmit a byte, and
                                 * TXC to 1.
                                 */
                                /* Set DRE to 1 and TXC to 1. */
                                s->reg8[R_USART_INTFLAG] |= 3;
                            }
                            break;

                        case 2:
                        case 3:
                            {
                                /*
                                 * SPI mode selected. Not implemented yet, but
                                 * it will soon allow the software to interact
                                 * with our board SSI bus.
                                 */
                                s->current_mode = SERCOM_SPI;

                                /* Set DRE to 1 and TXC to 1. */
                                s->reg8[R_USART_INTFLAG] |= 3;
                            }
                            break;

                        default:
                            /* Other modes are not supported. */
                            s->current_mode = SERCOM_UNSUPPORTED;
                            break;
                    }

                    /* Enable/disable interface based on value. */
                    s->enabled = (enabled == 1);

                    /* Store value. */
                    s->reg[addr / 4] = value & 0xffffffff;
                }
            }
            break;

        /**
         * Handle CTRLB register write operations. This register is mostly
         * used to enable/disable TX and RX operations on this interface.
         */
        case A_USART_CTRLB:
            {
                /* Keep track of RX/TX status. */
                s->rx_enabled = ((value & R_USART_CTRLB_RXEN_MASK) != 0);
                s->tx_enabled = ((value & R_USART_CTRLB_TXEN_MASK) != 0);

                /* Update register. */
                s->reg[addr / 4] = value & 0xffffffff;
            }
            break;

        /**
         * The DATA register is used to send a byte over USART and SPI.
         * For now, only USART is supported.
         * 
         * When a value is written into the DATA register and the current
         * mode is set to USART, we set this register value and we call
         * the `uart_transmit` function in order to send this byte to the
         * associated QEMU character device.
         */
        case A_SERCOM_DATA:
            {
                switch (s->current_mode)
                {
                    case SERCOM_USART:
                        {
                            /* Write register. */
                            s->reg16[R_SERCOM_DATA] = (value & 0xffff);

                            /* Mark byte as sent. */
                            s->pending_tx_byte = true;
                            uart_transmit(NULL, G_IO_OUT, s);
                        }
                        break;

                    case SERCOM_SPI:
                        {
                            /* Write register. */
                            s->reg16[R_SERCOM_DATA] = (value & 0xffff);

                            /* Transfer through SSI. */
                            sercom_spi_transfer(s);
                        }
                        break;

                    default:
                        break;
                }
            }
            break;


        /**
         * The INTENSET register is used to enable specific interrupt events.
         * 
         * Only the bits set to 1 are of interest, as each bit set will enable
         * the corresponding interrupt event (see section 26.8.6 of the
         * datasheet). 
         */

        case A_USART_INTENSET:
            {
                /* Enable corresponding interrupts. */
                s->interrupts |= (value & 0xff);
            }
            break;

        /**
         * The INTENCLR register is used to disable specific interrupt events.
         * 
         * Only the bits set to 1 are of interest, as each bit set will disable
         * the corresponding interrupt event (see section 26.8.5 of the
         * datasheet).
         * 
         * We just need to apply a negative mask to the interrupts events value
         * to clear the corresponding interrupt events.
         */

        case A_USART_INTENCLR:
            {       
                /* Force selected bits to 0. */
                s->interrupts &= ~(value & 0xff);
            }
            break;

        default:
            /* Update register. */
            s->reg[addr / 4] = value & 0xffffffff;
            break;
    }
    
    samd21_update_irq(s);
}

/**
 * The following `sercom_ops` structure defines the MMIO region read/write
 * handlers as well as some constraints regarding their implementation.
 * 
 * This structure is used when initializing the SERCOM MMIO registers region.
 */

static const MemoryRegionOps sercom_ops = {
    .read =  sercom_read,
    .write = sercom_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4
};


/**
 * Reset the SERCOM peripheral
 */

static void samd21_sercom_reset(DeviceState *dev)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(dev);

    /* No more pending byte. */
    s->pending_tx_byte = false;

