quarkslab/sstic-tame-the-qemu/qemu/hw/misc/samd21_sercom.c
    /* Cancel current transmission, if pending. */
    uart_cancel_transmit(s);

    /* Reset our registers. */
    memset(s->reg, 0, sizeof(s->reg));

    /* Clear FIFO, disabled TX/RX and disabled the interface. */
    s->rx_fifo_len = 0;
    s->rx_fifo_pos = 0;
    s->rx_enabled = false;
    s->tx_enabled = false;
    s->enabled = false;

    /* No mode specified. */
    s->current_mode = SERCOM_UNSUPPORTED;
}


/******************************************************************************
 * QEMU character device callbacks
 *****************************************************************************/

/**
 * The following `uart_receive` function is called by QEMU's character device
 * backend when a byte is received from the corresponding character device.
 * 
 * This byte is then stored in our RX FIFO, and some flags are set into the
 * INTFLAG register to tell the application code that we have just received
 * a byte. An interrupt is generated if conditions are met.
 */

static void uart_receive(void *opaque, const uint8_t *buf, int size)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(opaque);
    int i;

    /* Sanity checks. */
    if (size == 0 || s->rx_fifo_len >= UART_FIFO_LENGTH) {
        return;
    }

    /* Loop on received bytes and load them into our RX FIFO. */
    for (i = 0; i < size; i++) {
        uint32_t pos = (s->rx_fifo_pos + s->rx_fifo_len) % UART_FIFO_LENGTH;
        s->rx_fifo[pos] = buf[i];
        s->rx_fifo_len++;
    }

    /* Set the RXC bit of INTFLAG to notify the software. */
    s->reg8[R_USART_INTFLAG] |= (1 << R_USART_INTFLAG_RXC_SHIFT);

    /* Generate an IRQ if required. */
    samd21_update_irq(s);
}


/**
 * The following `uart_can_receive` function is called by QEMU's character device
 * backend to check if we can receive a byte.
 * 
 * We simply check that our RX FIFO is not empty and respond with the number of
 * bytes available if some space left, or 0 if our RX FIFO is full.
 */

static int uart_can_receive(void *opaque)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(opaque);

    return s->rx_enabled ? (UART_FIFO_LENGTH - s->rx_fifo_len) : 0;
}


/**
 * The following `uart_event` function is called by QEMU's character device
 * backend when a specific event occured on QEMU' side, like a closed serial
 * device or a transmission error.
 * 
 * We will handle the CHR_EVENT_BREAK event that notifies an error related to
 * the QEMU character device and reflects this error into our INTFLAG register.
 * 
 * We also generate an IRQ if required.
 */

static void uart_event(void *opaque, QEMUChrEvent event)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(opaque);

    /* Handle CHR_EVENT_BREAK only. */
    if (event == CHR_EVENT_BREAK) {
        /* Set the ERROR bit of INTFLAG to report the error. */
        s->reg8[R_USART_INTFLAG] |= (1 << R_USART_INTFLAG_ERROR_SHIFT);

        /* Send an IRQ if required. */
        samd21_update_irq(s);
    }
}

/******************************************************************************
 * SAMD21 SERCOM QOM class definition
 *****************************************************************************/

/**
 * @brief This function realizes a SAMD21 SERCOM object by setting the correct
 *        UART callbacks for the associated character device.
 * 
 * @param dev   Pointer to the SAMD21 SERCOM instance state structure
 * @param errp  Pointer to an Error structure to report any error
 */

static void samd21_sercom_realize(DeviceState *dev, Error **errp)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(dev);

    /* Set QEMU character device backend callbacks to handle UART events. */
    qemu_chr_fe_set_handlers(&s->chr, uart_can_receive, uart_receive,
                            uart_event, NULL, s, NULL, true);
}


/**
 * The `samd21_sercom_init` function initializes a SAMD21 SERCOM peripheral.
 * 
 * It creates the associated MMIO region to deal with registers read/write
 * operations, creates the single IRQ line for this peripheral (that will
 * be later connected to a CPU NVIC GPIO) and sets all the registers default
 * values as well as the peripheral internal state.
 */

static void samd21_sercom_init(Object *obj)
{
    SAMD21SERCOMState *s = SAMD21_SERCOM(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);
    DeviceState *dev = DEVICE(obj);

    /* Initialize the SERCOM MMIO operation handlers. */
    memory_region_init_io(&s->iomem, obj, &sercom_ops, s,
                          "samd21.sercom", SERCOM_SIZE);

    /* Associate the MMIO region with the device system bus. */
    sysbus_init_mmio(sbd, &s->iomem);

    /* Initialize a new IRQ associated with the device system bus. */
    sysbus_init_irq(sbd, &s->irq);

    /* Initialize a new SSI bus. */
    s->ssi = ssi_create_bus(dev, "ssi");

    /* Initialize 16-bit and 8-bit registers arrays. */
    s->reg16 = (uint16_t *)s->reg;
    s->reg8 = (uint8_t *)s->reg;

    /* Reset controller status. */
    s->reg16[R_SERCOM_STATUS] = 0x0000;
    s->pending_tx_byte = false;

    /* Cancel transmission. */
    uart_cancel_transmit(s);

    /* Reset registers. */
    memset(s->reg, 0, sizeof(s->reg));

    /* Flush FIFO, disable RX/TX, disable the device. */
    s->rx_fifo_len = 0;
    s->rx_fifo_pos = 0;
    s->rx_enabled = false;
    s->tx_enabled = false;
    s->enabled = false;

    /* No mode specified. */
    s->current_mode = SERCOM_UNSUPPORTED;
}

/**
 * SAMD21 SERCOM class properties.
 * 
 * This structure defines the only property exposed by this class,
 * the "chardev" property that allows the calling code to set the
 * character device to use when dealing with USART.
 * 
 */

static Property samd21_sercom_properties[] = {
    DEFINE_PROP_CHR("chardev", SAMD21SERCOMState, chr),
    DEFINE_PROP_END_OF_LIST(),
};

/**
 * The `samd21_sercom_class_init` function is in charge of initializing
 * our class object:
 * 
 *  - It sets the class `reset` and `realize` callbacks.
 *  - It configures the properties associated with the class.
 * 
 * These callbacks will be later called when an object of the SAMD21 SERCOM
 * class is instanciated.
 */

static void samd21_sercom_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = samd21_sercom_reset;
    dc->realize = samd21_sercom_realize;
    device_class_set_props(dc, samd21_sercom_properties);
}

/**
 * The following structure defines our class definition:
 * 
 *  - It defines our type name ("samd21.sercom").
 *  - It defines the parent class type (a system bus device).
 *  - It defines the instance size, basically the size of our state structure.
 *  - It defines the class init callback to `samd21_sercom_class_init` and the
 *    instance init callback (`samd21_sercom_init`).
 * 
 */
static const TypeInfo samd21_sercom_info = {
    .name = TYPE_SAMD21_SERCOM,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(SAMD21SERCOMState),
    .instance_init = samd21_sercom_init,
    .class_init = samd21_sercom_class_init
};


/**
 * The following `samd21_sercom_register_types` function is in charge of
 * registering all the types required by this module.
 * 
 * In fact, it only registers our class based on its type description.
 */

static void samd21_sercom_register_types(void)
{
    /* Register our "samd21.sercom" device type. */
    type_register_static(&samd21_sercom_info);
}

/* Register this module types registration callback. */
type_init(samd21_sercom_register_types)